Alter view Статистика_Разговоров
as
SELECT      dbo.Телефоны_Абонентов.Номер, dbo.Абоненты.Фамилия, dbo.Абоненты.Имя, dbo.Абоненты.Отчество, dbo.Разговоры.id_Разговоры, dbo.Разговоры.id_Телефона_Абонента, 
                         dbo.Телефоны_Абонентов.id_Телефона_Абонента,Разговоры.id_Телефона_Абонента ,dbo.Телефоны_Абонентов.id_Абонента, dbo.Абоненты.id_Абонента 
FROM             dbo.Телефоны_Абонентов INNER JOIN
                         dbo.Разговоры ON dbo.Телефоны_Абонентов.id_Телефона_Абонента = dbo.Разговоры.id_Телефона_Абонента INNER JOIN
                         dbo.Абоненты ON dbo.Телефоны_Абонентов.id_Абонента = dbo.Абоненты.id_Абонента